(* 変数がない場合の給与計算 (つらみ) *)
(25 * 850) + (28 * 850) + (31 * 850) ;;

(25 + 28 + 31) * 850 ;;


(* 変数宣言 let name = exer *)
let pi = 3.1415 ;;

(* 変数を使う *)
pi ;;

2.0 * pi ;;

(* 変数の命名規則 大文字はだめ *)
let Pi = 3.1415 ;;

(* 変数がある場合の給与計算 (よさみ) *)
let jikyu = 850;;

(25 * jikyu) + (28 * jikyu) + (31 * jikyu) ;;

Q3.1
(1)
let e = 2.7182 ;;

(2)
let positive = e > 0 ;;

(3)
seconds_of_day = 60 * 60 * 24 ;;

(4)
let name = "茗荷谷" ;;


Q.3.2

let e = 2.71828 ;;

  1.0 +. e *. 2.0
= 1.0 +. 2.71828 *. 2.0
= 1.0 +. 5.43656
= 6.43656

(* 変数は書き換えられない？ 代入の仕方はまだやってない。。。*)
let jikyu = 850 ;;
jikyu = 950 ;;
